[
  {
    "riddle": "It is greater than God and more evil than the devil. The poor have it, the rich need it and if you eat it you’ll die. What is it?",
    "answer": "Nothing."
  },
  {
    "riddle": "It walks on four legs in the morning, two legs at noon and three legs in the evening. What is it?",
    "answer": "Man"
  },
  {
    "riddle": "I am the beginning of the end, and the end of time and space. I am essential to creation, and I surround every place. What am I?",
    "answer": "The letter e. End, timE, spacE, Every placE"
  },
  {
    "riddle": "What always runs but never walks, often murmurs, never talks, has a bed but never sleeps, has a mouth but never eats?",
    "answer": "A river."
  },
  {
    "riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breath on this terrestrial ball. What am I?",
    "answer": "Tomorrow or the future."
  },
  {
    "riddle": "At night they come without being fetched. By day they are lost without being stolen. What are they?",
    "answer": "The stars."
  },
  {
    "riddle": " What is in seasons, seconds, centuries and minutes but not in decades, years or days?",
    "answer": "The letter ‘n’."
  },
  {
    "riddle": "The one who makes it, sells it. The one who buys it, never uses it. The one that uses it never knows that he’s using it. What is it?",
    "answer": "A coffin"
  },
  {
    "riddle": "The more you have of it, the less you see. What is it?",
    "answer": "Darkness"
  },
  {
    "riddle": "What has a head, a tail, is brown, and has no legs?",
    "answer": "A penny."
  },
  {
    "riddle": "What English word has three consecutive double letters?",
    "answer": "Bookkeeper."
  },
  {
    "riddle": "What’s black when you get it, red when you use it, and white when you’re all through with it?",
    "answer": "Charcoal."
  },
  {
    "riddle": "You throw away the outside and cook the inside. Then you eat the outside and throw away the inside. What did you eat?",
    "answer": "An ear of corn."
  },
  {
    "riddle": "I am always hungry,\nI must always be fed,\nThe finger I touch,\nWill soon turn red",
    "answer": "Fire"
  },
  {
    "riddle": "Ripped from my mother’s womb,\nBeaten and burned,\nI become a blood thirsty killer.\nWhat am I?",
    "answer": "Iron ore"
  },
  {
    "riddle": "I know a word of letters three. Add two, and fewer there will be!",
    "answer": "Few"
  },
  {
    "riddle": "I give you a group of three. One is sitting down, and will never get up. The second eats as much as is given to him, yet is always hungry. The third goes away and never returns.",
    "answer": "Stove, fire, smoke"
  },
  {
    "riddle": "I have four legs but no tail. Usually I am heard only at night. What am I?",
    "answer": "A frog. The frog is an amphibian in the order Anura (meaning “tail-less”) and usually makes noises at night during its mating season."
  },
  {
    "riddle": "Half-way up the hill, I see thee at last, lying beneath me with thy sounds and sights — A city in the twilight, dim and vast, with smoking roofs, soft bells, and gleaming lights.",
    "answer": "The past. (Longfellow)"
  },
  {
    "riddle": "When young, I am sweet in the sun.\nWhen middle-aged, I make you gay.\nWhen old, I am valued more than ever.",
    "answer": "Wine"
  },
  {
    "riddle": "All about, but cannot be seen,\nCan be captured, cannot be held,\nNo throat, but can be heard.",
    "answer": "Wind"
  },
  {
    "riddle": "If you break me\nI do not stop working,\nIf you touch me\nI may be snared,\nIf you lose me\nNothing will matter.",
    "answer": "Your heart"
  },
  {
    "riddle": "Until I am measured I am not known,\nYet how you miss me when I have flown.",
    "answer": "Time"
  },
  {
    "riddle": "I drive men mad\nFor love of me,\nEasily beaten,\nNever free.",
    "answer": "Gold"
  },
  {
    "riddle": "When set loose\nI fly away,\nNever so cursed\nAs when I go astray.",
    "answer": "A fart"
  },
  {
    "riddle": "Lighter than what I am made of,\nMore of me is hidden Than is seen.",
    "answer": "Iceberg"
  },
  {
    "riddle": "Each morning I appear to lie at your feet,\nAll day I will follow no matter how fast you run,\nYet I nearly perish in the midday sun.",
    "answer": "Shadow"
  },
  {
    "riddle": "My life can be measured in hours,\nI serve by being devoured.\nThin, I am quick\nFat, I am slow\nWind is my foe.",
    "answer": "A candle"
  },
  {
    "riddle": "I am seen in the water if seen in the sky,\nI am in the rainbow, a jay’s feather,and lapis lazuli.",
    "answer": "Blue"
  },
  {
    "riddle": "Glittering points that downward thrust,\nSparkling spears that never rust.",
    "answer": "Icicle"
  },
  {
    "riddle": "You heard me before, yet you hear me again,\nThen I die, ’till you call me again.",
    "answer": "An echo"
  },
  {
    "riddle": "Three lives have I.\nGentle enough to soothe the skin,\nLight enough to caress the sky,\nHard enough to crack rocks.",
    "answer": "Water"
  },
  {
    "riddle": "At the sound of me, men may dream or stamp their feet,\nAt the sound of me, women may laugh or sometimes weep.",
    "answer": "Music"
  },
  {
    "riddle": "What does man love more than life\nFear more than death or mortal strife\nWhat the poor have, the rich require,\nand what contented men desire,\nWhat the miser spends and the spendthrift saves\nAnd all men carry to their graves?",
    "answer": "Nothing"
  },
  {
    "riddle": "I build up castles.\nI tear down mountains.\nI make some men blind,\nI help others to see.\nWhat am I?",
    "answer": "Sand"
  },
  {
    "riddle": "Two in a corner,\n1 in a room,\n0 in a house, but 1 in a shelter. What am I?",
    "answer": "The letter r."
  },
  {
    "riddle": "Five hundred begins it, five hundred ends it,\nFive in the middle is seen;\nFirst of all figures, the first of all letters,\nTake up their stations between.\nJoin all together, and then you will bring\nBefore you the name of an eminent king.",
    "answer": "DAVID (Roman numerals)"
  },
  {
    "riddle": "It cannot be seen, it weighs nothing, but when put into a barrel, it makes it lighter. What is it?",
    "answer": "A hole"
  },
  {
    "riddle": "How far will a blind dog walk into a forest?",
    "answer": "Halfway. After he gets halfway, he’s walking out of the forest."
  },
  {
    "riddle": "What happens when you throw a yellow rock into a purple stream?",
    "answer": "It makes a splash."
  },
  {
    "riddle": "What starts with a T, ends with a T, and has T in it?",
    "answer": "A teapot"
  },
  {
    "riddle": "As I went over London Bridge I met my sister Jenny,\nI broke her neck and drank her blood and left her standing empty.",
    "answer": "A bottle of gin"
  },
  {
    "riddle": "Whoever makes it, tells it not.\nWhoever takes it, knows it not.\nWhoever knows it, wants it not",
    "answer": "Counterfeit money"
  },
  {
    "riddle": "I am, in truth, a yellow fork from tables in the sky,\nBy inadvertent fingers dropped the awful cutlery.\nOf mansions never quite disclosed and never quite concealed\nThe apparatus of the dark to ignorance revealed.",
    "answer": "Lightning"
  },
  {
    "riddle": "You saw me where I never was and where I could not be. And yet within that very place, my face you often see. What am I?",
    "answer": "A reflection"
  },
  {
    "riddle": "Say my name and I disappear. What am I?",
    "answer": "Silence"
  },
  {
    "riddle": "What is it that after you take away the whole, some still remains?",
    "answer": "Wholesome"
  },
  {
    "riddle": "A box without hinges, lock or key, yet golden treasure lies within. What is it?",
    "answer": "An egg"
  },
  {
    "riddle": "Forward I’m heavy, but backwards I’m not. What am I?",
    "answer": "Ton"
  },
  {
    "riddle": "Why doesn’t a mountain covered with snow catch cold?",
    "answer": "Because it has a snowcap "
  },
  {
    "riddle": "I can be long, or I can be short.\nI can be grown, and I can be bought.\nI can be painted, or left bare.\nI can be round, or square.\nWhat am I?",
    "answer": "A fingernail"
  },
  {
    "riddle": "One by one we fall from heaven down into the depths of past,\nAnd our world is ever upturned so that yet some time we’ll last.",
    "answer": "Sands in an hourglass"
  },
  {
    "riddle": "I drift forever with the current down these long canals they’ve made,\nTame, yet wild, I run elusive Multitasking to your aid.\nBefore I came, the world was darker, colder, sometimes, rougher, true\nBut though I might make living easy, I’m good at killing people too.",
    "answer": "Electricity (or lightning)"
  },
  {
    "riddle": "Reaching stiffly for the sky,\nI bare my fingers when it’s cold\nIn warmth I wear an emerald glove\nAnd in between I dress in gold",
    "answer": "A deciduous tree"
  },
  {
    "riddle": "Kings and queens may cling to power and the jester’s got his call,\nBut, as you may all discover, the common one outranks them all.",
    "answer": "An ace (in a deck of cards)"
  },
  {
    "riddle": "Every dawn begins with me\nAt dusk I’ll be the first you see\nAnd daybreak couldn’t come without\nWhat midday centers all about\nDaises grow from me, I’m told\nAnd when I come, I end all cold\nBut in the sun I won’t be found\nYet still, each day I’ll be around.",
    "answer": "The letter d."
  },
  {
    "riddle": "Kings and lords and christians raised them\nSince they stand for higher powers\nYet few of them would stand, I’m certain,\nIf women ruled this world of ours.",
    "answer": "A tower."
  },
  {
    "riddle": "Soft and fragile is my skin, I get my growth in mud\nI’m dangerous as much as pretty, for if not careful, I draw blood.",
    "answer": "A thorn"
  },
  {
    "riddle": "Three brothers share a family sport: A non-stop marathon\nThe oldest one is fat and short And trudges slowly on\nThe middle brother’s tall and slim And keeps a steady pace\nThe youngest runs just like the wind, a speeding through the race\n“He’s young in years, we let him run,” the other brothers say\n“‘Cause though he’s surely number one, he’s second, in a way.”",
    "answer": "The hands on a clock (hour, minute, second)."
  },
  {
    "riddle": "It’s true I bring serenity,\nAnd hang around the stars\nBut yet I live in misery;\nYou’ll find me behind bars\nWith thieves and villains I consort\nIn prison I’ll be found\nBut I would never go to court,\nUnless there’s more than one",
    "answer": "The letter s"
  },
  {
    "riddle": "I am a box that holds keys without locks, yet they can unlock your soul. What am I?",
    "answer": "A piano."
  },
  {
    "riddle": "There once was a strange man who loved wordplay, he had a very important and successful business that would take insect shipments from all across the world and distribute them to zoos across the US.",
    "answer": "ImportANT"
  },
  {
    "riddle": "There is one word that stands the test of time and holds fast to the center of everything. Though everyone will try at least once in their life to move around this word, but in fact, unknowingly, they use it every moment of the day. Young or old, awake or in sleep, human or animal, this word stands fast. It belongs to everyone, to all living things, but no one can master it. The word is?",
    "answer": "Gravity"
  },
  {
    "riddle": "My days are in the summer\nWhen you’ll eat me when I’m hot\nIn fact I’ll even eat myself\nWhere battles tough are fought\nBut when you find me in a fight\n‘Twill be high in the sky\nAnd if you catch me napping\nI suggest you let me lie\nWhen you’re bad come to my house\nFrom Ma get thoughts profound\nAm I big or am I small?\nSome say I’m just a pound.",
    "answer": "Dog. Dog days, hot dog, dog pound, dog fight."
  },
  {
    "riddle": "My first is twice in apple but not once in tart. My second is in liver but not in heart. My third is in giant and also in ghost. Whole I’m best when I am roast. What am I?",
    "answer": "A pig."
  },
  {
    "riddle": "What gets wetter as it dries?",
    "answer": "A towel"
  },
  {
    "riddle": "This is a most unusual paragraph. How quickly can you find out what is so unusual about it? It looks so ordinary you’d think nothing was wrong with it – and in fact, nothing is wrong with it. It is unusual though. Why? Study it, think about it, and you may find out. Try to do it without coaching. If you work at it for a bit it will dawn on you. So jump to it and try your skill at figuring it out. Good luck – don’t blow your cool!",
    "answer": "The most common letter in the English language, the letter e, is not found in the entire paragraph."
  },
  {
    "riddle": "When you went into the woods you got me.\nYou hated me yet you wanted to find me.\nYou went home with me cause you couldn’t find me\nWhat was it?",
    "answer": "A splinter"
  },
  {
    "riddle": "An iron horse with a flaxen tail.\nThe faster the horse runs,\nthe shorter his tail becomes.\nWhat is it?",
    "answer": "A needle and thread."
  },
  {
    "riddle": "You have to travel far before you turn it over. What is it?",
    "answer": "An odometer"
  },
  {
    "riddle": "A mile from end to end, yet as close to as a friend. A precious commodity, freely given. Seen on the dead and on the living. Found on the rich, poor, short and tall, but shared among children most of all. What is it?",
    "answer": "A smile."
  },
  {
    "riddle": "I’m full of holes, yet I’m full of water. What am I?",
    "answer": "A sponge"
  },
  {
    "riddle": "Four of us are in your field\nBut our differences keep us at yield\nFirst, a one that is no fool\nThough he resembles a gardener’s tool\nNext, one difficult to split in two\nAnd a girl once had one as big as her shoe\nThen, to the mind, one’s a lovely bonder\nAnd truancy makes it grow fonder\nLast, a stem connecting dots of three\nKnowing all this, what are we?",
    "answer": "The four suits in a deck of standard playing cards. The Spade is a gardener’s tool. The Diamond is the hardest gem to break. “Little Girl and Queen” is a Mother Goose rhyme, in which the Queen gave the girl a large diamond for picking the Queen some roses.The Heart bonds with the mind to form love. Absence makes the heart grow fonder.The Club, or Clover, is three dots connected around a stem."
  },
  {
    "riddle": "I am a word of meanings three.\nThree ways of spelling me there be.\nThe first is an odour, a smell if you will.\nThe second some money, but not in a bill.\nThe third is past tense, a method of passing things on or around.\nCan you tell me now, what these words are, that have the same sound?",
    "answer": "Scent, cent, sent"
  },
  {
    "riddle": "It’s red, blue, purple and green, no one can reach it, not even the queen. What is it?",
    "answer": "A rainbow."
  },
  {
    "riddle": "What question can you never honestly answer yes to?",
    "answer": "Are you asleep? (or dead)"
  },
  {
    "riddle": "What has a neck and no head, two arms but no hands?",
    "answer": "A shirt (or sweater, jacket etc)"
  },
  {
    "riddle": "I live in water\nIf you cut my head I’m at your door,\nIf you cut my tail I’m fruit,\nIf you cut both I’m with you\nWhat am I?\nA pearl. They’re found underwater. Removing the head (p) leaves Earl, a guy who could be at your door. Removing the tail (l) leaves pear, a fruit and if you cut both off you’re left with ear, which is with you because it’s attached to your head.",
    "answer": "A pearl. They’re found underwater. Removing the head (p) leaves Earl, a guy who could be at your door. Removing the tail (l) leaves pear, a fruit and if you cut both off you’re left with ear, which is with you because it’s attached to your head."
  },
  {
    "riddle": "Feed me and I live, give me drink and I die. What am I?",
    "answer": "Fire."
  },
  {
    "riddle": "What begins and has no end? What is the ending of all that begins?",
    "answer": "The best answer I’ve heard is death. It ends all that begins, and there’s no end to death. Another answer along the same lines is decay."
  },
  {
    "riddle": "A man went to the hardware store to buy items for his house.\n1 would cost $.25\n12 would cost $.50\n122 would cost $.75\nWhen he left the store he had spent $.75, what did he buy?",
    "answer": "House numbers"
  },
  {
    "riddle": "What makes a loud noise when changing its jacket, becomes larger but weighs less?",
    "answer": "Popcorn"
  },
  {
    "riddle": "The more you take, the more you leave behind.",
    "answer": "Footsteps"
  },
  {
    "riddle": "I am a word of 5 letters and people eat me. If you remove the first letter I become a form of energy. Remove the first two and I’m needed to live. Scramble the last 3 and you can drink me. What am I?",
    "answer": "Wheat, heat, eat, tea"
  },
  {
    "riddle": "Before any changes I’m a garlic or spice. My first is altered and I’m a hand-warming device. My second is changed and I’m trees in full bloom. The next letter change makes a deathly old tomb. Change the fourth to make a fruit of the vine. Change the last for a chart plotted with lines. What was I? What did I become? What did I turn out to be?",
    "answer": "Clove, glove, grove, grave, grape, graph"
  },
  {
    "riddle": "A woman shoots her husband, then holds him under water for five minutes. Finally, she hangs him. Five minutes later they enjoy a wonderful dinner together. How can this be?",
    "answer": "She took a photo of him and developed it in the dark room."
  },
  {
    "riddle": "Remove six letters from this sequence to reveal a familiar English word. BSAINXLEATNTEARS",
    "answer": "BANANAS (Removed SIX LETTERS)"
  },
  {
    "riddle": "Alive without breath,\nAs cold as death,\nClad in mail never clinking,\nNever thirsty, ever drinking",
    "answer": "A fish"
  },
  {
    "riddle": "With thieves I consort,\nWith the vilest, in short,\nI’m quite at ease in depravity;\nYet all divines use me,\nAnd savants can’t lose me,\nFor I am the center of gravity.",
    "answer": "The letter V"
  },
  {
    "riddle": "Until I am measured\nI am not known,\nYet how you miss me\nWhen I have flown.",
    "answer": "Time"
  },
  {
    "riddle": "I never was, am always to be,\nNo one ever saw me, nor ever will\nAnd yet I am the confidence of all\nTo live and breathe on this terrestrial ball.",
    "answer": "Tomorrow "
  },
  {
    "riddle": "Alive without breath,\nAs cold as death,\nNever thirsty, Ever drinking,\nClad in mail, Never clinking,\nDrowns on dry land,\nThinks an island, Is a mountain,\nThinks a fountain, Is a puff of air.",
    "answer": "A fish"
  },
  {
    "riddle": "This thing all things devours:\nBirds, beasts, trees, flowers;\nGnaws iron, bites steel;\nGrinds hard stones to meal;\nSlays king, ruins town,\nAnd beats high mountain down.",
    "answer": "Time"
  },
  {
    "riddle": "The cost of making only the maker knows,\nValueless if bought, but sometimes traded.\nA poor man may give one as easily as a king.\nWhen one is broken pain and deceit are assured.",
    "answer": "Promise"
  },
  {
    "riddle": "Who makes it, has no need of it.\nWho buys it, has no use for it.\nWho uses it can neither see nor feel it.",
    "answer": "A coffin"
  },
  {
    "riddle": "I build up castles. I tear down mountains.\nI make some men blind,\nI help others to see.\nWhat am I?",
    "answer": "Sand"
  },
  {
    "riddle": "Glittering points that downward thrust,\nSparkling spears that never rust.",
    "answer": "Icicle"
  },
  {
    "riddle": "Die without me, Never thank me.\nWalk right through me, never feel me.\nAlways watching, never speaking.\nAlways lurking, never seen.",
    "answer": "Air"
  },
  {
    "riddle": "Pregnant every time you see her, yet she never will give birth.",
    "answer": "Full moon"
  },
  {
    "riddle": "I go around in circles,\nBut always straight ahead\nNever complain,\nNo matter where I am led.",
    "answer": "Wheel"
  },
  {
    "riddle": "Thirty white horses on a red hill,\nFirst they champ,\nThen they stamp,\nThen they stand still.",
    "answer": "Teeth"
  },
  {
    "riddle": "Voiceless it cries,\nWingless flutters,\nToothless bites,\nMouthless mutters.",
    "answer": "Wind"
  },
  {
    "riddle": "I am seen in the water\nIf seen in the sky,\nI am in the rainbow,\nA jay’s feather,\nAnd lapis lazuli.",
    "answer": "Blue"
  },
  {
    "riddle": "If a man carried my burden\nHe would break his back.\nI am not rich,\nBut leave silver in my track.",
    "answer": "Snail"
  },
  {
    "riddle": "Each morning I appear\nTo lie at your feet,\nAll day I will follow\nNo matter how fast you run,\nYet I nearly perish\nIn the midday sun.",
    "answer": "Shadow"
  },
  {
    "riddle": "We are five little objects of an everyday sort\nyou will find us all in the ladies’ court",
    "answer": "Vowels"
  },
  {
    "riddle": "We are very little creatures; all of us have different features. One of us in glass is set; one of us you’ll find in jet. Another you may see in tin, and a fourth is boxed within. If the fifth you should pursue, it can never fly from you.",
    "answer": "The vowels"
  },
  {
    "riddle": "I heard of an invading, vanquishing army\nsweeping across the land, liquid-quick;\nconquering everything, quelling resistance.\nWith it came darkness, dimming the light.\nHumans hid in their houses, while outside\nspears pierced, shattering stone walls.\nUncountable soldiers smashed into the ground,\nbut each elicited life as he died;\nwhen the army had vanished, advancing northward,\nthe land was green and growing, refreshed.",
    "answer": "Rainstorm"
  },
  {
    "riddle": "Weight in my belly,\nTrees on my back,\nNails in my ribs,\nFeet I do lack.",
    "answer": "Ship"
  },
  {
    "riddle": "Some try to hide, some try to cheat, but time will show, we always will meet.\nTry as you might, to guess my name, I promise you’ll know, when you I do claim.",
    "answer": "Death"
  },
  {
    "riddle": "Stealthy as a shadow in the dead of night,\nCunning but affectionate if given a bite.\nNever owned but often loved.\nAt my sport considered cruel,\nBut that’s because you never know me at all.\nWhat am I?",
    "answer": "Cat"
  },
  {
    "riddle": "Of no use to one\nYet absolute bliss to two.\nThe small boy gets it for nothing.\nThe young man has to lie for it.\nThe old man has to buy it.\nThe baby’s right,\nThe lover’s privilege,\nThe hypocrite’s mask.\nTo the young girl, faith;\nTo the married woman, hope;\nTo the old maid, charity.\nWhat am I?",
    "answer": "Kiss"
  },
  {
    "riddle": "Three lives have I.\nGentle enough to soothe the skin,\nLight enough to caress the sky,\nHard enough to crack rocks.",
    "answer": "Water"
  },
  {
    "riddle": "The beginning of eternity\nThe end of time and space\nThe beginning of every end,\nAnd the end of every place.",
    "answer": "The letter E"
  },
  {
    "riddle": "I look flat, but I am deep,\nHidden realms I shelter.\nLives I take, but food I offer.\nAt times I am beautiful.\nI can be calm, angry and turbulent.\nI have no heart, but offer pleasure as well as death.\nNo man can own me, yet I encompass what all men must have.",
    "answer": "Ocean"
  },
  {
    "riddle": "A thousand colored folds stretch toward the sky,\nAtop a tender strand,\nRising from the land,\n‘Til killed by maiden’s hand,\nPerhaps a token of love, perhaps to say goodbye.",
    "answer": "Flower"
  },
  {
    "riddle": "In ye fire thou hear me scream! Creaking and whining yet I am dead before thoust layeth me upon ye hearth.",
    "answer": "Log"
  },
  {
    "riddle": "Hands she has but does not hold, teeth she has but does not bite, feet she has but they are cold, eyes she has but without sight. Who is she?",
    "answer": "A Doll"
  },
  {
    "riddle": "Bright as diamonds,\nLoud as thunder,\nNever still,\nA thing of wonder.",
    "answer": "Waterfall"
  },
  {
    "riddle": "Ten Men’s Strength,\nTen Men’s Length,\nTen Men can’t break it,\nYet a young boy walks off with it\nWhat am I?",
    "answer": "A rope"
  },
  {
    "riddle": "You heard me before,\nYet you hear me again,\nThen I die,\n‘Till you call me again.",
    "answer": "Echo"
  },
  {
    "riddle": "Inside me the adventurous find\nQuests and treasures of every kind.\nTrolls, goblins, orcs, and more, await\nWithin my closed walls for\nAll those that wish to visit me.\nYour hands are the key\nTo secrets untold,\nAnd your mind will unlock the door.\nWhat am I?",
    "answer": "Book"
  },
  {
    "riddle": "Two bodies have I,\nthough both joined in one.\nThe more still I stand,\nthe quicker I run.\nWhat am I?",
    "answer": "An hourglass"
  },
  {
    "riddle": "Lovely and round,\nI shine with pale light,\ngrown in the darkness,\nA lady’s delight.",
    "answer": "Pearl"
  },
  {
    "riddle": "What is it that given one, you’ll have either two or none?",
    "answer": "A Choice"
  },
  {
    "riddle": "Scythe of darkness,\nShadow’s light.\nGuiding eye\nOf thirteenth sight.",
    "answer": "Moon"
  },
  {
    "riddle": "As beautiful as the setting sun,\nAs delicate as the morning dew;\nAn angel’s dusting from the stars\nthat can turn the Earth into\nA frosted moon.\nWhat am I?",
    "answer": "Snow"
  },
  {
    "riddle": "To unravel me\nYou need a simple key,\nNo key that was made\nBy locksmith’s hand,\nBut a key that only I\nWill understand.",
    "answer": "Cipher"
  },
  {
    "riddle": "As a whole, I am both safe and secure.\nBehead me, and I become a place of meeting.\nBehead me again, and I am the partner of ready.\nRestore me, and I become the domain of beasts.\nWhat am I?",
    "answer": "Stable"
  },
  {
    "riddle": "A farmer and his hired help were carrying grain to the barn. The farmer carried one sack of grain and the hired help carried two sacks. Who carried the heavier load?",
    "answer": "Farmer (the hired help carried empty sacks)"
  },
  {
    "riddle": "When young, I am sweet in the sun.\nWhen middle-aged, I make you gay.\nWhen old, I am valued more than ever.",
    "answer": "Wine"
  },
  {
    "riddle": "Walk on the living, they don’t even mumble. Walk on the dead, they mutter and grumble",
    "answer": "Fallen leaves"
  },
  {
    "riddle": "What has roots as nobody sees,\nIs taller than trees\nUp, up it goes,\nAnd yet never grows?",
    "answer": "Mountain"
  },
  {
    "riddle": "I have a hundred legs, but cannot stand, a long neck but no head; I ease the maid’s life. What am I?",
    "answer": "A broom"
  },
  {
    "riddle": "When there is fire in me then I am still cold. When I own your true love’s face then you will not see me. To all things I give no more than I am given. In time I may have all things, and yet I can keep nothing. What am I?",
    "answer": "A mirror"
  },
  {
    "riddle": "I am, in truth, a yellow fork\nFrom tables in the sky\nBy inadvertent fingers dropped\nThe awful cutlery.\nOf mansions never quite disclosed\nAnd never quite concealed\nThe apparatus of the dark\nTo ignorance revealed.",
    "answer": "Lightning"
  },
  {
    "riddle": "What is greater than God,\nMore evil than the Devil,\nThe poor have it,\nThe rich want it,\nbut if you eat me,\nyou’ll die?",
    "answer": "Nothing"
  },
  {
    "riddle": "I make you weak at the worst of all times.\nI keep you safe, I keep you fine.\nI make your hands sweat, and your heart grow cold,\nI visit the weak, but seldom the bold.\nWhat am I?",
    "answer": "Fear"
  },
  {
    "riddle": "What has four wheels and flies?",
    "answer": "Garbage truck"
  },
  {
    "riddle": "I dig out tiny caves, and store gold and silver in them.\nI also build bridges of silver and make crowns of gold.\nThey are the smallest you could imagine.\nSooner or later everybody needs my help, yet many people are afraid to let me help them. Who am I?",
    "answer": "Dentist"
  },
  {
    "riddle": "I am the hole in the night,\nthe ever watchful eye.\nI return in a cycle,\nto enlighten the sky.",
    "answer": "The moon"
  },
  {
    "riddle": "With potent, flowery words speak I,\nOf something common, vulgar, dry;\nI weave webs of pedantic prose,\nIn effort to befuddle those,\nWho think I wile time away,\nIn lofty things, above all day\nThe common kind that linger where\nMonadic beings live and fare;\nPractical I may not be,\nBut life, it seems, is full of me!",
    "answer": "\nBut life, it seems, is full of me!"
  },
  {
    "riddle": "A Riddle",
    "answer": "A Riddle"
  },
  {
    "riddle": "A box without hinges, key or lid,\nYet golden treasure inside is hid.",
    "answer": "Egg"
  },
  {
    "riddle": "No sooner spoken than broken",
    "answer": "Silence"
  },
  {
    "riddle": "On my way to St. Ives,\nI met a man with seven wives.\nEach wife had seven sacks,\nEach sack had seven cats,\nEach cat had seven kits.\nKits, cats, sacks, wives,\nHow many were going to St. Ives?",
    "answer": "One"
  },
  {
    "riddle": "A big Indian and a little Indian are walking down the street.\nThe little Indian is the son of the big Indian but the big Indian is not the father of the little Indian. How is this possible?",
    "answer": "The big Indian is the Mother"
  },
  {
    "riddle": "I do not breathe, but I run and jump.\nI do not eat, but I swim and stretch.\nI do not drink, but I sleep and stand.\nI do not think, but I grow and play.\nI do not see, but you see me every day.",
    "answer": "I am a leg"
  },
  {
    "riddle": "You can see nothing else\nWhen you look in my face,\nI will look you in the eye\nAnd I will never lie.",
    "answer": "Your reflection"
  },
  {
    "riddle": "Blend a teapot shot so the pearlies won’t rot!",
    "answer": "Toothpaste"
  },
  {
    "riddle": "I blind you, I give you food, I give you light, I give you death, I give you life, I am always there, I am never there. What am I?",
    "answer": "The sun"
  },
  {
    "riddle": "Whilst I was engaged in sitting\nI spied the dead carrying the living",
    "answer": "Ship"
  },
  {
    "riddle": "Tool of thief, toy of queen.\nAlways used to be unseen.\nSign of joy, sign of sorrow.\nGiving all likeness borrowed.",
    "answer": "Mask"
  },
  {
    "riddle": "My first is in wield, sever bones and marrow.\nMy second is in blade, forged in cold steel.\nMy third is in arbalest, and also in arrows.\nMy fourth is in power, plunged through a shield.\nMy fifth is in honour, and also in vows\nMy last will put an end to it all.\nWhat am I?",
    "answer": "Weapon"
  },
  {
    "riddle": "People are hired to get rid of me.\nI’m often hiding under your bed.\nIn time I’ll always return you see.\nBite me and you’re surely dead.",
    "answer": "Dust"
  },
  {
    "riddle": "Always wax, yet always wane: I melt, succumbed to the flame.\nLighting darkness, with fate unblest, I soon devolve to shapeless mess.",
    "answer": "Candle"
  },
  {
    "riddle": "Large as a mountain, small as a pea,\nEndlessly swimming in a waterless sea.",
    "answer": "Asteroids"
  },
  {
    "riddle": "Two words, my answer is only two words.\nTo keep me, you must give me.",
    "answer": "Your word"
  },
  {
    "riddle": "At the sound of me, men may dream\nOr stamp their feet\nAt the sound of me, women may laugh\nOr sometimes weep.",
    "answer": "Music"
  },
  {
    "riddle": "What has a forest but no trees.\ncities but no people and\nrivers but no water??",
    "answer": "Map"
  },
  {
    "riddle": "I have rivers without water,\nForests without trees,\nMountains without rocks\nTowns without houses.\nWhat am I?",
    "answer": "A Map"
  },
  {
    "riddle": "When I’m metal or wood,\nI help you get home.\nWhen I’m flesh and I’m blood,\nIn the darkness I roam.",
    "answer": "A bat"
  },
  {
    "riddle": "Runs smoother than any rhyme, loves to fall but cannot climb!",
    "answer": "Water"
  },
  {
    "riddle": "If you were running a race, and you passed the person in 2nd place, what place would you be in now?",
    "answer": "2nd"
  },
  {
    "riddle": "I am a box that holds keys without locks, yet they can unlock your soul.\nWhat am I?",
    "answer": "Piano"
  },
  {
    "riddle": "When you call out my name, I am no longer with you. What am I?",
    "answer": "Silence"
  },
  {
    "riddle": "Forward I’m heavy\nBackwards I’m not",
    "answer": "ton"
  },
  {
    "riddle": "A horrid monster hides from the day,\nWith many legs and many eyes.\nWith silver chains it catches prey,\nAnd eats it all before it dies.\nYet in every cottage does it stay,\nAnd every castle ‘neath the sky.",
    "answer": "A spider"
  },
  {
    "riddle": "What can you put in a barrel to make it lighter?",
    "answer": "A hole"
  },
  {
    "riddle": "What do you use to hoe a row, slay a foe, and wring with woe?",
    "answer": "Hands"
  },
  {
    "riddle": "As destructive as life,\nAs healing as death;\nAn institutioner of strife,\nJust as prone to bless.\nIt is all that is good,\nYet with an evil trend;\nAs it was the beginning of things,\nIt can also be the end.",
    "answer": "Fire"
  },
  {
    "riddle": "Runs over fields and woods all day\nUnder the bed at night sits not alone,\nWith long tongue hanging out,\nA-waiting for a bone.",
    "answer": "A shoe"
  },
  {
    "riddle": "Whoever makes it, tells it not.\nWhoever takes it, knows it not.\nAnd whoever knows it wants it not.",
    "answer": "Counterfeit money"
  },
  {
    "riddle": "My head bobs lazily in the sun.\nYou think I’m cute,\nFor my face is yellow,\nMy hair is white,\nand my body is green.\nWhat am I?",
    "answer": "Daisy"
  },
  {
    "riddle": "At night they come without being fetched,\nAnd by day they are lost without being stolen.",
    "answer": "Stars"
  },
  {
    "riddle": "There is not wind enough to twirl\nThat one red leaf, nearest of its clan,\nWhich dances as often as dance it can.",
    "answer": "The sun"
  },
  {
    "riddle": "When is a door not a door?",
    "answer": "When it is ajar"
  },
  {
    "riddle": "My tines be long,\nMy tines be short\nMy tines end ere\nMy first report.\nWhat am I?",
    "answer": "Lightning"
  },
  {
    "riddle": "From house to house I go, sometimes narrow, sometimes wide. And whether there’s rain or snow I always stay outside. What am I?",
    "answer": "A Path"
  },
  {
    "riddle": "I went to the woods and got it, when i got it didn’t want it, looked for it, couldn’t find it so I took it home.\nWhat is it?",
    "answer": "Splinter"
  },
  {
    "riddle": "As light as a feather, but you can’t hold it for ten minutes.",
    "answer": "Breath"
  },
  {
    "riddle": "My first is not bent around.\nMy second means “lift her up”\nor “cut her to the ground.”",
    "answer": "Straight Razor"
  },
  {
    "riddle": "Hickory-Dickory-Dock!\nThe mouse ran up the clock.\nThe clock struck one\nand down did come.\nHickory-Dickory-Dock!\nWhat am I?",
    "answer": "A guillotine"
  },
  {
    "riddle": "I am just two and two. I am hot. I am cold.\nI’m the parent of numbers that cannot be told.\nI’m a gift beyond measure, a matter of course,\nAnd I’m yielded with pleasure- then taken by force.",
    "answer": "Kiss"
  },
  {
    "riddle": "I protect your money from robbers and thieves\nThree numbers to tell me is all that you’ll need\nIf your memory fails you I’m useless indeed",
    "answer": "Combination lock"
  },
  {
    "riddle": "Something wholly unreal, yet seems real to I\nThink my friend, tell me where does it lie?",
    "answer": "In the mind"
  },
  {
    "riddle": "I give you a group of three.\nOne is sitting down, and never will get up.\nThe second eats as much as is given him,\nyet is always hungry.\nThe third goes away and never returns.\nStove, fire, and smoke",
    "answer": "\nStove, fire, and smoke"
  },
  {
    "riddle": "My face is always changing, but is always the same.",
    "answer": "Moon"
  },
  {
    "riddle": "Alive without breath,\nCold as death,\nNever thirsty, always drinking,\nAll in mail and never clinking.",
    "answer": "Fish"
  },
  {
    "riddle": "Armless, legless, I crawl around when I’m young.\nThen the time of changing sleep will come.\nI will awake like a newborn, flying beast,\n’till then on the remains of the dead I feast.",
    "answer": "Maggot"
  },
  {
    "riddle": "If I fly to the moon in a ship an on the way i meet five other ships each with five crew members who each have five pets. How many in all are flying to the moon?",
    "answer": "One"
  },
  {
    "riddle": "I saw a creature: his stomach stuck out behind him,\nenormously swollen. A stalwart servant\nwaited upon him. What filled up his stomach\nhad travelled from far, and flew through his eye\nHe does not always die in giving life\nto others, but new strength revives\nin the pit of his stomach; he breathes again.",
    "answer": "Bellows"
  },
  {
    "riddle": "What does the job of an assassin and treachery of a thug?",
    "answer": "Time"
  },
  {
    "riddle": "It is said among my people that some things are improved by death.\nTell me, what stinks while living, but in death, smells good?",
    "answer": "Pig"
  },
  {
    "riddle": "This darksome burn, horseback brown,\nHis rollock highroad roaring down,\nIn coop and in comb the fleece of his foam\nFlutes and low to the body falls home.",
    "answer": "River"
  },
  {
    "riddle": "What goes in the water red, and comes out black?",
    "answer": "Iron"
  },
  {
    "riddle": "A precious stone, as clear as diamond.\nSeek it out whilst the sun’s near the horizon.\nThough you can walk on water with its power,\nTry to keep it, and it’ll vanish ere an hour.",
    "answer": "Ice"
  },
  {
    "riddle": "With no wings, I fly. With no eyes, I see. With no arms, I climb.\nMore frightening than any beast, stronger than any foe. I am cunning, ruthless, and tall; in the end, I rule all.",
    "answer": "The imagination"
  },
  {
    "riddle": "Take me and scratch my head.\nWhat once was red,\nIs black instead.\nWhat am I?",
    "answer": "A Match"
  },
  {
    "riddle": "It cannot be seen, cannot be felt,\nCannot be heard, cannot be smelt.\nIt lies behind stars and under hills,\nAnd empty holes it fills.\nIt comes first and follows after,\nEnds life, kills laughter.",
    "answer": "Dark"
  },
  {
    "riddle": "Half-way up the hill, I see thee at last\nLying beneath me with thy sounds and sights —\nA city in the twilight, dim and vast,\nWith smoking roofs, soft bells, and gleaming lights.",
    "answer": "The Past"
  },
  {
    "riddle": "I’m pleasing to the eye\nA tool for many absent of mind\nA tapestry of fickle lies\nBlind to even the most pensive spies\nI’m often the breeder of fervent lust\nBut I am by far one you shouldn’t trust",
    "answer": "Appearance"
  },
  {
    "riddle": "An eye in a blue face\nSaw an eye in a green face.\n‘That eye is like to this eye’\nSaid the first eye,\n‘But in low place\nNot in high place.’",
    "answer": "Sun shining on daisies which are growing in a field"
  },
  {
    "riddle": "All about, but cannot be seen,\nCan be captured, cannot be held\nNo throat, but can be heard.",
    "answer": "Sound"
  },
  {
    "riddle": "What goes through the door without pinching itself?\nWhat sits on the stove without burning itself?\nWhat sits on the table and is not ashamed?",
    "answer": "The sun"
  },
  {
    "riddle": "A red cap on my head,\na stone in my throat,\nif you tell me the answer,\nI’ll give you a Groat.\nWhat am I?",
    "answer": "A cherry"
  },
  {
    "riddle": "What gets wetter and wetter as it dries?",
    "answer": "Towel"
  },
  {
    "riddle": "I have four legs but never walk\nI may be covered in flowers but have no soil\nI hold food three times a day but never eat a meal",
    "answer": "Table"
  },
  {
    "riddle": "What measures out time,\nUntil in time\nAll is smashed to it?",
    "answer": "Sand"
  },
  {
    "riddle": "Ripped from my mother’s womb,\nBeaten and burned,\nI become a blood-thirsty slayer\nWhat am I?",
    "answer": "Iron ore"
  },
  {
    "riddle": "Iron roof, glass walls\nBurns and burns\nAnd never falls.\nWhat am I?",
    "answer": "A Lantern"
  },
  {
    "riddle": "I weaken all men for hours each day.\nI show you strange visions while you are away.\nI take you by night, by day take you back,\nNone suffer to have me, but do from my lack.\nWhat am I?",
    "answer": "Sleep"
  },
  {
    "riddle": "First you see me in the grass dressed in yellow gay;\nnext I am in dainty white, then I fly away. What am I?",
    "answer": "A Dandelion"
  },
  {
    "riddle": "The more of these you take, the more appear behind you",
    "answer": "Steps"
  },
  {
    "riddle": "Inside the green house there was a white house\nInside the white house there was a red house.\nInside the red house there were lots of babies.",
    "answer": "Watermelon"
  },
  {
    "riddle": "If you break me, I’ll not stop working.\nIf you can touch me, my work is done.\nIf you lose me, you must find me with a ring soon after.\nWhat am I?",
    "answer": "The heart"
  },
  {
    "riddle": "Creatures of power, creatures of grace,\nCreatures of beauty, creatures of strength.\nAs for their lives, they set everything’s pace,\nFor all things must come to live under their emerald embrace. . .\nEither in their life, or in their death.\nWhat am I?",
    "answer": "Tree"
  },
  {
    "riddle": "I have the same name as a porcelain face,\nyet I carry great loads from place to place.",
    "answer": "Dolly"
  },
  {
    "riddle": "It has a long neck,\nA name of a bird,\nFeeds on cargo of ships,\nIt’s not alive.",
    "answer": "Crane"
  },
  {
    "riddle": "I cut through evil\nlike a double edged sword,\nAnd chaos flees at my approach.\nBalance I single-handedly upraise,\nThrough battles fought with heart and mind,\nInstead of with my gaze.\nWhat am I?",
    "answer": "Justice"
  },
  {
    "riddle": "Always invisible, yet never out of sight. What are they?",
    "answer": "The letters I & S"
  },
  {
    "riddle": "You are trapped in a room made of dry cement, with four walls, a ceiling, floor, no windows nor doors, holes are scarce, and all you have is a box of matches.\nHow do you get out of the room?",
    "answer": "Three strikes, and you’re out"
  },
  {
    "riddle": "Placed above it makes greater things small.\nPlaced beside it makes small things greater.\nIn matters that counts it always comes first.\nWhere others increase it keeps all things the same.\nWhat is it?",
    "answer": "1"
  },
  {
    "riddle": "I’m by nature solitary, scarred by spear\nand wounded by sword, weary of battle.\nI frequently see the face of war, and fight\nhateful enemies; yet I hold no hope\nof help being brought to me in the battle,\nbefore I’m eventually done to death.\nIn the stronghold of the city sharp-edged swords,\nskilfully forged in the flame by smiths,\nbite deeply into me. I can but await\na more fearsome encounter; it is not for me\nto discover in the city any of those doctors\nwho heal grievous wounds with roots and herbs.\nThe scars from sword wounds gape wider and wider;\ndeath blows are dealt to me by day and by night.",
    "answer": "Shield"
  },
  {
    "riddle": "What is put on a table, cut, but never eaten?",
    "answer": "Cards"
  },
  {
    "riddle": "As I was going to St Ives,\nI met a man with seven wives.\nEach wife had seven sacks,\nEach sack had seven cats,\nEach cat had seven kits;\nKits, cats, sacks and wives –\nHow many were going to St Ives?",
    "answer": "One"
  },
  {
    "riddle": "How can a woman living in New Jersey, legally marry 3 men, without ever getting a divorce, be widowed, or becoming legally separated?",
    "answer": "She’s a Justice of the Peace"
  },
  {
    "riddle": "Within, I clean all that is bad and is old.\nI make juice that’s the colour of gold.\nShould I die, a filter machine would you need assembled to replace me\n… and beans I resemble.",
    "answer": "Kidney"
  },
  {
    "riddle": "What travels alone but is never alone, has a name but doesn’t exist?",
    "answer": "A shadow"
  },
  {
    "riddle": "I turn around once,\nWhat is out will not get in.\nI turn around again,\nWhat is in will not get out.",
    "answer": "Iceberg"
  },
  {
    "riddle": "What runs around a city\nbut never moves?",
    "answer": "City Wall"
  },
  {
    "riddle": "An arm points north, east, south, then west.\nEver in circles, never pausing to rest.\nIt passes its brother twenty three times,\nAs the sun passes by and the moon starts to climb.",
    "answer": "Clock"
  },
  {
    "riddle": "It comes only before,\nIt comes only after,\nRises only in darkness,\nBut rises only in light.\nIt is always the same,\nBut is yet always different.\nWhat am I?",
    "answer": "Moon"
  },
  {
    "riddle": "Name-called And favourite to eat,\nHas only two toes on print of feet,\nColours many,\nAlmost any Country child would have seen one",
    "answer": "Chicken"
  },
  {
    "riddle": "My thunder comes before my lightning.\nMy lightning comes before my rain.\nAnd my rain dries all the ground it touches.\nWhat am I?",
    "answer": "A volcano"
  },
  {
    "riddle": "There are 3 words in the English language. These three words all end in -gry. One is hungry, the other is angry. The third is one that you use every day, if you were paying attention I already gave you the answer.",
    "answer": "The English Language"
  },
  {
    "riddle": "I am born in fear, raised in truth,\nand I come to my own in deed.\nWhen comes a time that I’m called forth,\nI come to serve the cause of need.",
    "answer": "Courage"
  },
  {
    "riddle": "What can you sit on, sleep on, and brush your teeth with?",
    "answer": "A chair, a bed, and a toothbrush."
  },
  {
    "riddle": "What happens four times in every week, twice in every month and once in a year?",
    "answer": "The letter E"
  },
  {
    "riddle": "What is black when you buy it, red when you use it, and grey when you throw it away?",
    "answer": "Charcoal"
  },
  {
    "riddle": "What makes noise,\nstops noise,\nand does not like noise?",
    "answer": "Your wife"
  },
  {
    "riddle": "What work is it that the faster you work,\nthe longer it is before you’re done,\nand the slower you work,\nthe sooner you’re finished?\n    Roasting meat on a spit",
    "answer": "Roasting meat on a spit"
  },
  {
    "riddle": "A beggar’s brother died, but the man who died had no brother.\nHow could this be?",
    "answer": "The beggar was a woman"
  }
]